export const WATCH_PARTY_INVITE_NOTIFICATION_TYPE = "WATCH_PARTY_INVITE" as const;

export const WATCH_PARTY_DISABLED_TOOLTIP =
  "امکان حضور در تماشای آنلاین گروهی، ۳۰ دقیقه قبل از شروع بازی فراهم میشه. در این حالت میتونید روی دکمه کلیک کنید و با دوستان به صورت آنلاین مسابقه را تماشا کنید";

export const WATCH_PARTY_ACTIVE_TOOLTIP =
  "تماشا مسابقه فوتبال با دوستان یه صفایی دیگه ای داره! بزن بریم.";

export const WATCH_PARTY_JOIN_DESCRIPTION =
  "یک فضای آنلاین برای شما ایجاد کردیم که با دوستانت فوتبال ببینی، کوری بخونی، کَل کَل کنی و لذت ببری. در اتاق تماشا میتونی به صورت صوتی یا از طریق چت، حس و حال دور هم بودن رو هم تجربه کنی. فقط توجه کن که اگر داور اتاق متوجه بشه باعث بی‌احترامی به کسی شدی، به کاپیتان بُردین خبر میده و ممکنه اعتبارت در بُردین کاهش پیدا کنه. فکر نکنم بخوایی در جمع بُردین برچسب فرد بی‌اخلاق بهت بخوره. توجه: برای ورود لازمه که نرم افزار گوگل میت رو نصب کرده باشی.";

export const WATCH_PARTY_FULL_MESSAGE = "دیر اومدی! ظرفیت اتاق تکمیل شده!";

export const WATCH_PARTY_INSUFFICIENT_COINS = "متاسفانه سکه شما برای ورود کافی نیست";

export const ONLINE_PRESENCE_MS = 5 * 60 * 1000;
